#ifndef __STEPPER_H
#define __STEPPER_H
#include "sys.h"
#include "delay.h"
//////////////////////////////////////////////////////////////////////////////////	 
//步进电机使用的是5线4相直流减速步进电机
//直径：28mm  电压：5V  步进角度：5.625 x 1/64  减速比：1/64
//步距角：5.625 / 64 = 0.087度 
//一个脉冲内部转子转5.625度，由于减速64倍，外部轴只转了0.087度
//外部轴要转一圈的话，需要360/0.087=4096个脉冲。
//4相8拍驱动，8个脉冲是一个周期
//4096/8=512个周期，外部轴刚好转一圈						  
////////////////////////////////////////////////////////////////////////////////// 	



void stepper_Init(void); //LED初始化函数
void stepper(u8 phase[],u8 t);
void stepper_angle(float angle,u8 t);
#endif
